{
    "id": "na14f0a8cc28e",
    "title": "10/1 DX EXPO展(Bizcrew)レポート：クリスピー・クリーム・ドーナツの復活と再成長の裏側",
    "link": "https://note.com/nomuragoro/n/na14f0a8cc28e",
    "author": "中 翔（のむらごろう）| IT教育の効果的な受講方法の案内人",
    "publish_date": "2024-10-01T16:19:29+09:00",
    "content": [
        "（Qiitaに書こうとしたんですが、どう考えてもエンジニア向けに結びつかないぞ？となって急遽こちらに移行しました）",
        "向こうには慣れている話なので省略してますが、この記事はセミナーを聞きながらリアルタイムで書いているため、無編集・無チェックです。誤字脱字誤変換などご容赦ください。",
        "専門用語が多すぎて筆者註を（カッコ書き）で入れていますが、筆者は食品業界の知見がない（上に、企業ごとにオリジナル用語が造語されていることを知っている）ので間違っている可能性があります。",
        "本日のイベント・セミナーカンファレンスなど",
        "https://expo.bizcrew.jp/event/10959",
        "この会は「11:00~11:40」セミナー会場A(6F)",
        "会場がどこか分かりにくい＆遠いので大変！",
        "ちょうど反対側のテレワークブースで充電していたので、そこから歩いていくと10分はかかる。",
        "ビックサイトの会議棟（セミナーA会場）と南棟（B・C会場と展示）が遠いので、一度会議棟に来た後の次の回がまたセミナーA会場の場合、もう戻ろうという気持ちも起こらない…。",
        "今回がまさにそうで、次の回もA会場に参加したいので、この後過ごし方を考えないといけないなぁ。",
        "本題",
        "入社前のイメージと実態の乖離に悩む。",
        "店舗は荒れ、目標はデータに基づいていない数値を書いただけのもの、これを改善するために「ピープルマネジメント」を実施",
        "`",
        "成果＝戦略ｘ推進力`",
        "にある",
        "体制変更と大量閉店",
        "店長の上にエリアマネージャーがいて本部長を入れる体制",
        "店長の上にスーパーバイザーを入れて、RM（説明がないのでこれがわからない。専門用語だろう）の上に本部長とした。スーパーバイザーは脱・年功序列のために社外からも募るようにした。",
        "その結果として大量閉店になったが、業績不振ではない（メディアも大量閉店＝業績不振と考えたのであろう）",
        "大量閉店から始まる体制変更",
        "若手登用によりスーパーバイザーからミドルマネジメント層へ。",
        "顧客接点の強化としてサービスや店舗誘引策（＝集客？）を講じたり、ブランディング戦略を打ち出したり。",
        "とはいえ、人材育成施策が最も重要で",
        "現場復活：目に見えて分かりやすい変化を起こす",
        "全従業員がやる",
        "経営と現場がコミュニケーションする：（双方向ではなく単方向に見える。トップダウン？）",
        "↑現場のメンバーも経営層と参加するワークショップを開催する",
        "「同じことを繰り返す」ことで浸透率を上げていく。",
        "やったこと・やらなかったこと",
        "ポイントは「ブランド価値を毀損する選択をしない」こと",
        "従業員",
        "やった：教育・業務効率化への投資",
        "やらない：人員削減、報酬減額",
        "商品販促",
        "やった：日本での商品開発",
        "やらない：値下げ・外部化",
        "店舗",
        "やった：フラグシップ出店・不採算エリアからの撤退",
        "やらない：出店凍結",
        "所感",
        "食品業界は何でもかんでも略語や専門用語を使っているけど、外部向けに紹介するときは分かりにくくないか？というのがどうにも気になる。",
        "IT業界でそれをやると他の企業はこぞって真似し始めるので、いつの間にか市民権を得ている感がある（QAとかSREとか。だいたいGoogle発祥なイメージ）",
        "Qiitaの方で記事を一本化することにします。",
        "ディズニーランド「本気のブランディング」安孫子 薫氏のセミナーレポートもそちらに載せてます。",
        "https://qiita.com/nomurasan/items/25606008f16deb5dbaf6"
    ]
}