{
    "id": "n6d45bafe3",
    "title": "noteのIPアドレス流出でコロナ禍の行動が筒抜けに？！",
    "publish_date": "2020-08-14T16:39:32+09:00",
    "status": "publish",
    "post_type": "post",
    "content": [
        "えらい騒ぎになってしまったのと、私にも関係があるのでゴチャゴチャされる前に出しておこうと、そういう話です。",
        "# はじめに",
        "私個人のIPが流出したから誰かが困る、という事は（身の回りでは）特にないです。",
        "また、私自身についてもnoteではネット名義を使っていますが、合わせて本名も公開していて隠す気もないです。",
        "IPアドレスが見れる5chや悪どいブログ、Twitterもまともにやってないですから、いわゆる一般ユーザーにはあまり大きな問題にはならないです。",
        "が、普段から発信がメインの著名人や芸能人は困りますね…。",
        "他のサービスを使っていた場合、IPが一致したら",
        "本人である可能性",
        "が浮上してしまいます。",
        "# 同一IPで別人が別のアカウントを使ってnoteに書き込んでいてもおかしくありません",
        "私が関係ある部分がこれです。私のIPアドレスで他のユーザーがnoteに書き込んでいる可能性はあります。",
        "というのも、私は一人暮らしではないからです。",
        "IPアドレスが流出しても個人を特定できない理由というのはこういう事象からです。",
        "前提として、IPアドレスは「その時」のものなので、固定して使っている企業や特定個人、あるいはそういうプロバイダーでもなければ特定にはならないです。",
        "また、家族が同じ端末あるいはネットワークルーターを使っている場合も同じIPになります。",
        "ちょっと黒い話ですが、proxyを改ざんするとIPアドレスも変わります。",
        "セキュリティ意識の高い人は当たり前に使っていますが、一般の方がproxyを変えるなんて事はやらないでしょうが、可能性を否定する事はできません。",
        "私はセキュリティコンサルのご依頼を受けていませんので実態は分かりませんが、セキュリティ屋をやっていた経験から言うとIPアドレスを変える事は難しくありません。",
        "なので、今回の騒動でnoteで流出したIPアドレスのリストと別サービスのIPアドレスが一致したから本人だ、というのは間違っています。",
        "# IPアドレスが流出するとどんな情報が使われるのか？",
        "上記より本人を特定出来ないとは言いましたが、本人である可能性がある事がわかるのは企業としては嬉しいです。",
        "自社サービスを利用しているIPアドレスがnoteを使っていて、この人はどういう事に興味があるのか、というのを一発で調べられるからです。",
        "たとえば、TwitterやInstagramで使っているIPとnoteのIPが一致したら、行動がモロバレしてしまうわけです。",
        "「あの人は別人だから」といっても「本人の可能性がある」という情報が非常に重要でおいしいのです。",
        "とはいえ、あくまで可能性なので実際にレコメンドするかは別ですがIPアドレスのリストは企業にとってほしい情報である事は間違いないわけです。",
        "## 小話",
        "noteがIPアドレスを取得していたのは、IPアドレスを使って何か広告を出そうとかそういう面があったのかも知れません。",
        "流出の対策をしたけどIPアドレスを取り続けているのなら、こういうことをやっていないとは言い切れません。",
        "この仕組を使っているサービスとして、アマゾン広告やGoogle広告、楽天広告などがあります。",
        "# TwitterやInstagramなどを使っている人は気をつけて",
        "私が本当にこわいのは、note＋他のサービスを使っているユーザーです。",
        "他でIPアドレスが流出すると、第三者にも「noteと他のサービスを使っている」可能性が分かるのです。",
        "多いのは、アダルトサイトへのアクセスがトラッキングされている可能性ですね。",
        "たとえば、私がFANZAなりを使ってるであろうなのは過去記事を見れば容易に想像がつくだろうと思っていますが、自分から声を大にして言うことはないでしょう。",
        "これは男性心理として「同好の士と意見交換したい」という思いと「あんまり大っぴらにすることじゃない」というTPOを気にしつつ楽しむという事を、よく知らない第三者に突かれたくないわけです。",
        "普段から怪しいサイトのお世話になっている方は、怪しいサイトにアクセスする時だけ別の端末やネットワークを使うという手も考えておいたほうが良いかも知れません。",
        "noteは家から、やんちゃをする時はネットカフェ（スマホの4G/5G回線や公共Wifiなど）を使う手もありますね。",
        "（ただし、ネットカフェを利用するためには会員証を作る必要がありますので、可能性は必ず残る仕組みになっています）",
        "今回の騒動で言えば、noteとたとえばAmazonや楽天のIPが分かると、noteユーザーがどういうものを見たか・買ったかが分かるからです。",
        "とはいえ、厳密には公共ネットワークの方が別のセキュリティリスクがありますので、安全なインターネットを利用するかどうかは本人のネットリテラシーに委ねられるところがあります。",
        "# お詫び",
        "恣意的なタイトルをつけています。",
        "これはIPアドレスが発覚した＝個人情報の流出だと考えるセンシティブな方にこそ読んでほしいからです。",
        "# 次の記事",
        "https://note.com/nomuragoro/n/na92cf9585e6d"
    ],
    "images": [
        {
            "src": "/assets/n6d45bafe3e01_32c5f490697fc2af0368ed77fcb7c276.png",
            "alt": "",
            "width": null,
            "height": null
        }
    ]
}