{
    "id": "n5a6627bde",
    "title": "絵が描けない私が絵を描こうと決心した動画と、絵を描き始める第一歩の話をしたい",
    "publish_date": "2020-08-22T17:31:20+09:00",
    "status": "draft",
    "post_type": "post",
    "content": [
        "ご無沙汰です、",
        "note騒動があってから、大丈夫だよみたいな記事を書いたんですが、どうも家族はそう思わなかったためnoteへのアクセス自体をブロックしていました。",
        "が、この度noteに投稿しても大丈夫な仕組みを整備したので、試験的に運用してみます。",
        "それでも漏れたら大変なので、家から投稿できない状態なのは変わらずです。",
        "そのため更新頻度が激減しています。ご容赦ください…。",
        "（とはいえ、こういう状況にしたのは私ですが^^;)",
        "# 絵を描こう！",
        "と言うのも考えるのも簡単ですね。",
        "たぶん線一本、円一つ描くのにめっちゃくちゃ抵抗があると思います。",
        "私もあります。",
        "頭を占めるのは「上手く描けない」です。",
        "そこで、どういう絵を描きたいかを考えるところから始めます。",
        "が、自分で考えるのは難しいし、上手い絵は描けないから「どういう絵なら描けるか」を考えていきましょう。",
        "これを探すのが超絶大変でキツくて見つかった頃にはやる気がなくなるので、参入障壁が低いものを探しました。",
        "それがこちらの動画です。",
        "https://www.youtube.com/embed/kmpps47nLro?rel=0",
        "描き手さん(Hydeさん：この声で五十路)が超うるさいのですが、二回ぐらい見てると講師に指導されている気分になってきます。",
        "復習で三回流すと気にならなくなります。",
        "そんな感じで",
        "最初にお話しますが、描き手さんは「",
        "絵は上手くなくていい、勉強しなくていい。それよりも大事な事が漫画家になるために必要だ",
        "」と言っています。",
        "なので動画視聴者としての対象者は漫画家（プロ）になりたい人向けです。",
        "が、プロになろうと思わないけど絵を上手く描けるようになりたい私のようなユーザーでもためになる動画がこちらです。",
        "# この動画のいいところ",
        "下手に描いて、添削して上手く見えるように描いて教えてくれる",
        "ことです。",
        "私も元同人作家（絵師ではないです）なので絵を見る目は多少あります。",
        "オタクステータスも少々ありますので上手い人が下手な人のマネをするのが難しいという事も理解しているので、この動画には本気でビビりました。",
        "なんと、上手い人が下手に描くというアプローチで解説が始まったのです。これは描けない人にとって非常にありがたいです。",
        "動画内3分ぐらいで全体が出来ているのですが、この時点でも（描けない人基準で）可愛いんですよね。",
        "コメント欄でも言われていますが、体のパーツが理解できてバランスが取れているために下手なんだけど技術的な話ばかりで、根本的な部分は良いんですよね。",
        "つまり、動画で語られていない「バランス」の部分さえ押さえれば参入できるわけです。",
        "絵が描けなくてもバランスを取ることは出来るんじゃないか？と思ったのでやってみます。",
        "そこまで行き着いてない人は、この動画を１時間ぐらい流し見し続けてください。",
        "絵を描きたいけど絵が描けない、と歯がゆく思っている人や苦痛に感じなかった人は次のステップに進めるはずです。",
        "# 絵が描けない人はバランスも分からない",
        "ので、これを解決していきます。",
        "絵が描けない人がバランスを取るためには、描く・自分を鏡や写真で見て模写するより、理論を学ぶのが一番手っ取り早いです。",
        "なぜなら、鉛筆を持っても一描き目をどうすればいいかわからないので、一時間経っても白紙のままだからです。",
        "null",
        "これを流し読みすると、とりあえず○を書けば顔のアタリが取れる、という事を理解できます。",
        "○が描けたら",
        "- なんとなく十字をひとつ描く",
        "- なんとなく十字の水平線上に片目の位置を決めて○を描く",
        "- なんとなく反対側に均等な位置にもう片方の目の位置を決めて○を描く",
        "- なんとなく正三角形っぽい場所にクチビルを置く",
        "- AとかBとかCとかDとかワケ分からんけど自分の絵に当てはめてなんとなく位置を合わせてみる",
        "- なんとなく○の上部分より更に離れた場所に半円を描いて髪の毛だと言いはる",
        "までは出来るようになりました。",
        "（がぞ）",
        "# 体のバランスは？",
        "null",
        "更に難しい事を言い出しました。",
        "とりあえず簡単にしたいので直立不動にします。"
    ],
    "images": []
}