{
    "id": "nab7510c22",
    "title": "システム開発：お仕事のご依頼・ご提案について",
    "publish_date": "2020-07-18T21:15:43+09:00",
    "status": "publish",
    "post_type": "post",
    "content": [
        "https://paiza.hatenablog.com/entry/2020/07/16/%E5%84%AA%E7%A7%80%E3%81%AA%E3%82%A8%E3%83%B3%E3%82%B8%E3%83%8B%E3%82%A2%E3%82%92%E6%8E%A1%E7%94%A8%E3%81%A7%E3%81%8D%E3%81%AA%E3%81%84%E4%BA%BA%E4%BA%8B%E6%8B%85%E5%BD%93%E3%81%AB%E4%B8%8D%E8%B6%B3",
        "人事・スカウト向けのお話です。",
        "全文を読む必要はないです。課題と、解決が至ってシンプルだからです。",
        "御社のエンジニア採用には、同じエンジニアをぶつけてみませんか？",
        "# 結論から述べます",
        "社内のエンジニアを増やすために、社外のエンジニアを顧問にする",
        "のが一等早い道です。",
        "そもそも、社外のエンジニアに開発を依頼するメリットとして開発費用を下げられることがありますが、システムトラブルに対応してくれるわけではないのでサーバーなどの障害発生時に誰も対応できなくて、結局費用がかさんでしまうという問題があります。",
        "運用に最低限必要なノウハウが蓄積されないのでシステム運用後の保守は難しくなり、結局保守のためにまた社外からシステムエンジニアを呼び込むことになります。",
        "実際に、私もこのような窮地に陥ったプロジェクトを救うためにオファーをいただいたことも一度や二度ではありません。",
        "# 外部からシステムコンサルタントを呼んでシステムを開発する",
        "これが現在の業界のスタンダードになっていますが、システムコンサルタントにシステムの提案を依頼するよりは、自社システムチームを構築・強化する方が有意義です。",
        "将来に投資する広い視野が必要になりますが、皆さんが口を揃えてYESと言うのに、",
        "実際問題として社内の稟議に通らないとか予算がなくて運転資金をシステムに依存している",
        "事が多いです。",
        "# 作ったシステムが使われない",
        "なぜこれについて語られないんでしょうかね？",
        "私が知らないだけで、実は業界のタブーか何かでしょうか？",
        "システム構築時のオーダーをいただく際に、要件として業務を包括的に見る事はできないので、例外については独自対応をお願いして合意を得ます。",
        "その上で通常業務の効率化を課題にしてシステムを運用するのですが、",
        "運用の現場としては全部できないなら必要ない",
        "、と考えるようです。",
        "この食い違いについて、発注時やシステム要件定義では全く考慮されません。",
        "# 採用担当者に開発経験がない",
        "これはリンク先でも問題に上げていますが、注意が必要な点としてあくまでシステム会社が採用する場合において、という問題です。",
        "システム会社ではない会社の人事がエンジニアを求める場合は、社内の風潮や文化を押し付けないようにする環境作りを進めていけるかどうか、にあります。",
        "## 補足",
        "今の若い世代、特にエンジニアに多いのですが会社に忠誠心とか",
        "ない",
        "です。",
        "能力のある人は、正社員やある程度自由度の高い派遣社員よりフリーランスで活躍したい、と考えるぐらいに存在しないです。",
        "自社でエンジニアを育てられるか？",
        "という話でもありますが……。",
        "別のアプローチを検討しましょう。",
        "世間のエンジニア教育で失敗している例を見ていただければ分かりますが、エンジニアの能力は他の職人と同じで場数を踏んでナンボです。",
        "ただし、技術力を高めるだけなら自主的に取り組めば高めることが出来ます。（英語のドキュメントを読める・個人で海外のサービスにお金を払って活用できるなど）",
        "これを会社の負担ではなく、個人の負担になっているからエンジニアの費用が安く見えますが、会社で抱えたい場合はこういった教育コストを掛ける必要があります。",
        "また、社外で様々な現場を経験し、社内に帰ってこられるような環境作りが求められるのは言うまでもありません。",
        "# そこまでやってエンジニアが欲しいか？",
        "社内で抱える必要はありません。できる人は自ら率先してやります。",
        "必要なのは「このクライアントの案件なら他社より優先的に請けてもいい」と思ってもらうことです。",
        "結論としては、",
        "社外のエンジニアに社内の事情を把握してもらって、社内に体制を作るようにする",
        "のが良いでしょう。",
        "こういった振る舞いをするのは、システムコンサルタントであり、いわゆるＣＴＯやＣＩＯの存在です。",
        "# 私からお願いしたいこと",
        "先ほどの記事に戻りましょう。",
        "採用関係者の中で採用基準が固まっていない",
        "事は些細な問題です。",
        "自社の開発環境や業務内容についてきちんと伝えられていない",
        "のが致命的で、これが決まらないとシステムコンサルタントとの話も出来ません。",
        "外注業者を使うと、この辺りをふんわりやってくれるので話が早いですが、自社で採用する場合は業務内容が不明瞭のままだと被採用者も何をすればよいか分からなくなります。",
        "自社の何をシステムで解決して、どこから自社の人的リソースを活用するのかは見据えておくべきです。",
        "システムに詳しくない方にとっては、これは非常に難しい話だと思いますので、自社のシステム化から一緒に考えていきましょう。",
        "# ご依頼",
        "Facebookなど（本名名義）をご利用ください。",
        "ビズリーチやwantedlyなどをはじめ、大体の登録サービスを活用しておりますので、定額プランの方はそちらでも構いません。"
    ],
    "images": [
        {
            "src": "/assets/nab7510c2279d_7e8f1950576850bddafa4b973b302e70.png",
            "alt": "",
            "width": null,
            "height": null
        }
    ]
}