{
    "id": "ne0492cb5f",
    "title": "【半沢直樹】TVerの広告がウザすぎるので再生を防ぎつつ、無料ソフトで快適に録画する【見逃し視聴】",
    "publish_date": "2020-09-23T19:28:24+09:00",
    "status": "publish",
    "post_type": "post",
    "content": [
        "のむらです、IPアドレス流出事件からnoteへの投稿が及び腰になってしまっている事は否めません…",
        "現状は別媒体で書いているんですが、本件は過去にnoteにも書いた事なのでこちらにも書いておきます。",
        "# はじめに",
        "3点、大事なお話をします。",
        "本旨はあくまで「テレビで録画は大丈夫なのにTVerなど配信サイトで録画するのはダメなのはおかしい」という考えに基づきます。",
        "録画したものを（広告収益などを目的にした）アップロードをする事を推奨していません。",
        "なお、テレビでもCMは流れるのでTVerの広告はそりゃそうだよね、ぐらいの感覚ですが、録画した後のデータを使って編集ソフトで広告部分をカットするのだから、広告をスキップする事で手間を軽減しようというものです。",
        "普段から広告をカットすると、今まで無料で視聴できていた番組が今後登録されずTVerが不便になる可能性が高まるため、",
        "普段から広告をカットすることは推奨していません。",
        "繰り返しになりますが、これらのサービスが無料で閲覧・公開している事には理由があります。",
        "普段利用されているサービスだからこそ、よくご理解いただいた上でご活用ください。",
        "# TVerの新シリーズ半沢直樹を広告無しで視聴する",
        "「Brave」というブラウザ（アプリ）を使うことで広告ナシで視聴できました。",
        "https://brave.com/ja/download/",
        "見るだけならiPhoneなりAndroidOS端末でも使えます。",
        "これはTVerのような専用ブラウザではないので、とりあえずTVerに飛んで再生すれば同じように使えます。",
        "## 懸念点",
        "普段から広告をカットすると、今まで無料で視聴できていた番組が今後登録されずTVerが不便になる可能性が高まるため、",
        "普段から広告をカットすることは推奨していません。",
        "繰り返しになりますが、これらのサービスが無料で閲覧・公開している事には理由があります。",
        "普段利用されているサービスだからこそ、よくご理解いただいた上でご活用ください。",
        "# 無料で画面を録画する",
        "色々な有料ソフトや有料アプリをダウンロードさせる記事が目立ちますが、Windows10なら「Windows」＋Gキーを同時押しするとこのような画面がオーバーレイ表示されます。",
        "録画ボタンを押して画面を開けば開始されます（録画アイコンが表示されます）",
        "保存先の空き容量に注意しましょう。",
        "## 懸念点",
        "本旨はあくまで「テレビで録画は大丈夫なのにTVerなど配信サイトで録画するのはダメなのはおかしい」という考えに基づきます。",
        "録画したものを（広告収益などを目的にした）アップロードをする事を推奨していません。",
        "# 反省",
        "当初は一つずつ丁寧な書き方にした方がいいかな、と思ったんですが難しいところがないので逆に短くまとめてしまって簡単アピールをするか！という方針に変えました。",
        "事実、自分でも試しにやってみましたが、ここに書いている事以上に気にする事はなかったです。",
        "が、乱用されてサービスが不便になる事は期待していません。",
        "これはとても大事な事なので、各項目に注意事項を繰り返し書いています。",
        "いち利用者として思うのが、広告表示についても本来は強制されるべきではないし、強制されるとしても、ほどほどに表示されるなら気にしないでおこうと思いました。",
        "が、見れば分かりますが、これだけ広告を乱発されたら利用者としても不便なので対策を講じています。",
        "何事も「ほどほど」であって欲しいと思うのです。",
        "本記事では利用者へのモラルを訴えていますが、提供者にもモラルは必要と説きます。",
        "従って、無料で公開する事にしていますが利用者側のモラルが欠如していると判断した場合、直ちに非公開もしくは削除措置を講じます。",
        "本記事の一部もしくは全部が転載・転用あるいはWeb魚拓などがされた事を当方で検知した場合は、魚拓作成者にも然るべき措置と対応をお願いする事がありますので予めご了承ください。"
    ],
    "images": [
        {
            "src": "/assets/ne0492cb5ff34_bdaac31a5a8d0854475bb390ce37e71c.png",
            "alt": "",
            "width": null,
            "height": null
        },
        {
            "src": "/assets/ne0492cb5ff34_picture_pc_de19d9164e9adf7a804796cb25f8b61a.png",
            "alt": "標準録画",
            "width": "620",
            "height": "357"
        }
    ]
}