{
    "id": "n6c3128540083",
    "title": "隠居軍師の救国ストラテジー「輝かしい勝利」獲得指南と攻略考察",
    "publish_date": "2024-09-22T14:42:25+09:00",
    "status": "publish",
    "post_type": "post",
    "content": [
        "もう二度とできる気がしない、と思ったけど終わってから振り返るに、勘所は分かったのでなんだかんだでできそう（深夜テンション）",
        "ストーリーモードではファルコネット砲のお世話になりっぱなし。木装備の兵が伸びているのは間違いなく実績解除の試行錯誤の痕跡",
        "私の実績より、天才軍師までの間に大きな壁があり、救国の軍師から以降にまた壁がある印象。とはいえ、諦めずに挑戦してほしい。筆者は（挫折時間含め）一年近く頑張ってやり遂げられた。",
        "攻略",
        "天才軍師",
        "それぞれのスキルツリーの相生が美しい",
        "まずは基本から。ここでの考え方が後述の称号獲得にも非常に重要になるため、敢えて残す。",
        "そもそも、スキルツリーの一番下を一つでも取れれば強いので、３つもあったら色々なことができるよね、という欲張りオーダー。レベルを上げるよりも選択肢を増やした方が体感では強いと感じやすいので、取れるものは全部取った。",
        "生産性を引き上げる魔法ギルドがとても強く、また魔法ギルドの魔法石集めを神殿がフォローし、また神殿があるので改良型製鉄所が強く、改良型採掘所には石ブーストの砦魔神、序盤はとりあえず侍１置いとくだけでなんとかできるので思った以上に隙がない。",
        "色々な戦略が取りやすいので案外初見でもなんとかなるだろう。選択肢が多すぎて土地の狭さが気になるが、魔法研究所を急がせれば生産は補強できるのと、神殿をうまく育てられれば採石所も製鉄所も陳腐化できるので、後半はかなり余裕ができる。",
        "森の力を操る者",
        "森の力を操る者。木装備の兵は作りやすいが、量産体制を整えようとするとかなり重いので、実は最序盤が一番の課題だ。",
        "一番最後に獲得した称号だが、今思い返せば一番シンプルだったかも。",
        "課題は序盤の弱さ。基本的に木装備なので物量でなんとかするのが基本戦術なのだが、いかんせん序盤が辛すぎる。最初は冒険者ギルドから侍を連れてくる事も検討したものの、一時凌ぎはできても長期的には茶葉が重たすぎる。木装備とアーチャーを主役に育てる事を考えると砦魔神の石自動生産と研究ブーストの方が使いやすい印象。",
        "剣を極めし者＆城砦国家を築く者",
        "剣を極めし者。採掘場を２積みにして研究所に１つ使っているのは序盤から鉄を集めるためにもう１枠欲しかった。",
        "城砦国家を築く者。最終的に鋼鉄にも頼ったので改良型製鉄所を３積みでも悪くない",
        "初手からファルコネット砲に依存していく前提のオーダーにする。とにかく鉄が余るのでLv10〜Lv15が実質無制限でレベルアップできるようなもの。これが思った以上に強い。何気に石が入りやすいので鉄生産にもブーストがかかる。",
        "後半は鉄不足（主に鉄装備の兵を盾にするため）になるので、採掘場強化のために石も生産が必要。",
        "魔法を極めし者＆新大陸の開拓者",
        "魔法を極めし者。重カノン砲が強すぎるので、基本は冒険者ギルドのサポート役として動く",
        "新大陸の開拓者。マジックウォールや魔法兵は弱くなるが、土地が広くなるので増えた土地は魔法研究所にしてしまおう。こちらの方が生産の伸びも良い",
        "侍＆重カノン砲を主力に、マジックウォールと魔法兵で回していくオーダー。石を活用しやすいという強みが地味に有効で、Lv5〜10が早い。冒険者ギルドに石生産アップはないので若干足並みが揃わないものの、そもそも石の出番が少ないのであまり気にならない。",
        "神殿と魔法研究所のアップグレードのおかげで資源面で苦労することはなかったが、後半に茶葉の生産が追いつかなくなったり、マジックウォールだけで耐えるのがつらくなって魔法兵との配分をどうするか悩んだり、魔法石にしても茶葉にしても生産限界を迎えやすいという困った特徴があり、余った資源を使って全ての兵種を全投入する局面もあった。茶葉を節約するなら侍ではなくウォードレイダーでも良かったかもしれない",
        "その他のオーダー考察",
        "公式的にはクリア可能のことだが、私は諦めた。",
        "どちらがLv4でLv1かは考慮しない",
        "フォレストセージ＋製鉄工房",
        "ファルコネット砲に夢を見た後に着手したがフォレストセージでアーチャーをしっかり鍛えられるのでファルコネット砲と役割が被ってしまう。",
        "鋼鉄を自動生産できたところで、使い所がなく鋼鉄兵をアーチャーの盾にするぐらい。育ててないので鋼鉄兵自体が弱いし、そもそも製鉄所が木材生産を奪うので相性は良くない。",
        "フォレストセージ＋魔法研究所",
        "木材と食料をブーストできるので強い。が、どちらも序盤が遅いので安定した立ち上がりを目指す場合はアンマッチ。決まればすごく輝きそうなので、いつか挑戦したさはある。",
        "フォレストセージ＋砦魔神",
        "フォレストセージLv4について言及したので、砦魔神Lv4から見てどうか？というとあまり強くない。",
        "砦魔神は石装備兵の強化ではなく砦への強化を受けるためフォレストレンジャーのツリーと噛み合うところがない。そもそも石があまり強くないので、石と砦をメインにすると結構きついので、中途半端な状態の木装備の兵が来たところで活用が非常に難しい。",
        "フォレストセージ＋領土開拓",
        "とにかく序盤が遅い。ウォードレイダーor侍＋なにか（使わない）の構成で最初の茶葉50を使い切った後は木材と食料の大量生産体制に入る必要があるため、神殿は石や鉄の生産に回す。茶葉をちまちま作っている暇はない。領土開拓で土地＋１の強みは感じるが食料を犠牲にするので、結果的には砦魔神の方が早くなった印象",
        "製鉄工房＋魔法研究所",
        "魔法研究所で出力を上げつつ、手が届かない鋼鉄を製鉄工房がサポートできる、のだが序盤が悩みの種。とにかく土地が狭い。人材確保を３積みしても狭い。鋼鉄兵を育ててから生産に入れれば良さそうに見えるが、そもそも鋼鉄の生産自体が重いので改良型製鉄所の出番はないかもしれない。このオーダーの場合、兵力確保をを考えるなら鋼鉄生産アップを６積みするのも面白い。",
        "製鉄工房＋冒険者ギルド",
        "天才軍師でも述べたが、実は相性がいい",
        "ファルコネット砲を主力にしつつ鋼鉄生産で神殿のサポートができる。序盤の重さは茶葉で補いつつ、溢れ気味な鋼鉄を使って彼らの盾にする作戦はハマる。茶葉メインにする方法もなくはないが、茶葉自体が重いので",
        "研究の枠が不足しがちのため土地は思っている以上に広くはならないのがキズだが、序盤の石〜鉄集めさえ乗り切れれば安定して強さを発揮できる。",
        "魔法研究所＋城塞都市",
        "石が輝く唯一のオーダー（だと思う）",
        "砦で人材を増やしつつ、砦魔神を増やすという防衛力マシマシな組み立て方をしていくのが良い。砦魔神を主力にする場合、採石場は２つ欲しいのと、木材がファルコネット並みに持っていかれるので思っている以上に食料が足りなくなる。魔法研究所はこういった面で非常に心強いので積極的に活用していこう。",
        "なお、後半のラッシュに備えて採石場を増築していくので、思った以上に土地が足りなくなる。食料の捨て時（諦め時）を見極めよう。",
        "城塞都市＋冒険者ギルド",
        "砦委任と研究促進、領土拡大で土地も人材も余るはずだったが、肝心の兵力集めに非常に苦労する。最初から終盤までの計画をしっかり立てないと途中で詰むので、慣れないうちは何度もやり直し前提で試行錯誤して欲しい。ヒントとしては、砦魔神を育てるより重カノン砲に集めた方が強いので茶葉を集める前提ではあるのだが、茶葉だけでは後半のラッシュには耐えられないので、鉄装備兵も集められるだけ準備しておこう。砦魔神は残念ながら役に立たないので、石は採掘場に回そう。",
        "番外編・RPGモード",
        "難易度ABCの遊び方とは一変するので、メモを残しておく",
        "レベルを上げたら何をする？",
        "スキルポイントを優先、余ったら食料と木材に振り分けていく。スキルツリーは3-3(2, 1)-1になるように取っていくと分かりやすく強くなる。フォレストレンジャーだけがやっぱり微妙。英雄の塔は強いんだけど、育ち切った居住区の方が使いやすいかもしれない。セージの生産コストが意外と重く、同じ人材０なら忍者の方がまだ使えそうなのが残念。どちらも使いにくいのが残念。",
        "初手のコツ",
        "神殿＋改良型採掘場・製鉄所を１つでも積んでいる場合は、初手で作ってすぐ削除しておく",
        "神殿を開放している場合は、事前に発見済みの資材でなければ生産することができない。後でやろうとすると土地が余っておらず、開放するために敵対勢力を倒して土地を奪ったり、既存の土地を壊す必要がある。",
        "なお、神殿は後述の専用兵種の吟味のためにリセマラをすることになる。",
        "神殿の兵種評価",
        "神殿を開放している場合、兵舎で徴用できるのは以下。",
        "ウォードレイダー or 侍",
        "ロングボウ or 重カノン",
        "忍者",
        "パターンを網羅すると以下の通り。",
        "ウォードレイダー・ロングボウ",
        "どちらも軽いので主力にすると後半がつらい",
        "ウォードレイダー・重カノン",
        "重カノンを主力に、ウォードレイダーを盾にするケース。が、ウォードレイダーに茶葉を使うのが勿体無いので、盾役は他の兵種を使った方が良い",
        "ウォードレイダー・忍者",
        "正直、ウォードレイダーより忍者の方が強いので重カノンと同じような運用になりそう。しかしどちらも軽いので主力にはならない",
        "侍・ロングボウ",
        "侍は強いので盾役としても優秀だが、ロングボウが軽いので先制攻撃役として微妙か。",
        "侍・重カノン",
        "どちらも重いため、運用には見極めが必要。筆者は愛用している組み合わせ",
        "侍・忍者",
        "侍の強さが際立つので忍者の茶葉が勿体無いと感じてしまう",
        "ロングボウ・忍者",
        "最初は忍者を、忍者のコストが上がったらロングボウに切り替えるぐらいで良い。特に忍者は人材を使わないので序盤に早い組み合わせ",
        "重カノン・忍者",
        "重カノンを主力にする場合、忍者はいらないし、重カノンを主役にしない場合は茶葉がいらないので必然的に忍者は使われなさそう",
        "茶葉を主力にするなら重カノンだけ固定にして他は何でもいい（おそらく使う機会がないため）",
        "なお、リスタートでは兵種が変わらないため、ステージ選択で戻って再挑戦しよう。",
        "縛りプレイ・RPGモードなのにレベルアップ（と異界の城）を使わないでやってみる",
        "茶葉の力（侍・忍者）が強い",
        "エルフの集落：０P",
        "獣人の村：４P",
        "未クリア時、正規の方法では鉄が解禁されないので、改良型採掘場を入れておくと楽",
        "魔法国家：８P",
        "未クリア時、正規の方法では鋼鉄が解禁されないので、改良型製鉄所を入れておくと楽。かなりきついが頑張ればできる",
        "ドワーフの頼み事：１２P",
        "かなりシビア。茶葉を大事に使っていきたい。忍者の活用がポイント",
        "神の無茶振り：１６P",
        "無理ゲー、諦めた。建物のレベルを倍化ができないと異界の城ありでも手応えを感じるレベル。",
        "後は手が届かないので書けない…。",
        "救国の軍師（難易度C）であればファルコネット砲に頼りっきりだったので、うまいこと生産を回せる状態を作れればいけるが、後半になるとジリ貧になるのでファルコネット砲を守るための人員確保も忘れずに。",
        "体験版・前作紹介",
        "https://unityroom.com/games/simple-rts",
        "無料で遊べる前作？というか前身。システムは同じだがゲーム性が違うので注意。本作の無料体験版も遊べるので「隠居軍師の救国ストラテジー とま団 cien dlsite」あたりで検索してみよう。"
    ],
    "images": [],
    "post_id": "58"
}