{
    "id": "ndc77430d723c",
    "title": "Qiitaで記事を書くのはもうやめようと思う",
    "link": "https://note.com/nomuragoro/n/ndc77430d723c",
    "author": "中 翔（のむらごろう）| IT教育の効果的な受講方法の案内人",
    "publish_date": "2020-07-15T15:11:37+09:00",
    "content": [
        "はじめにお伝えしますが、Qiitaには大変お世話になっています。",
        "私もQiitaは好きですし、恩返しをしたい思いはあるのです。",
        "が、利用規約や運営による記事の非公開化、アカウント停止などの騒動を見て思うのが「いつか私もこうなる」という強い猜疑心でした。",
        "なので、「見るし好きだし応援してる」んですが、「私はここで記事を書きたくない」でした。",
        "もちろん、読まれないから別にいいか、という考えもありますが…。",
        "私は過去に情報屋（システムエンジニアとかそういう意味ではなく、情報を売る仕事）をしていた事もあり、どこからどこまでが無料でどこからが有料（優良）情報だという意識が非常に強くあります。",
        "それだけ、自身の発信する情報の品質を意識します。",
        "情報の品質とは、",
        "内容が優れている",
        "とか",
        "話題性がある",
        "とか、直接的な価値もありますが",
        "誰が発信している",
        "とか",
        "内容のわかりやすさ",
        "も重要なポイントだと考えています。",
        "利用者の方に直接口頭でアンケートを取ってみると、私はどうやら後者に優れるようです。",
        "ちょっとだけグチらせてください",
        "おかげさまで、本業プログラマー・システムエンジニアの私から業務を発注・委託して受注していただける方が増えてきました。",
        "私の知人で記事制作を代行してくださるブロガーの方はまだいませんので、このような記事は私が直接書いているのですが、記事作成についても案件を出していこうかと考えているところです。",
        "SEO関連に詳しくない方でもサポートできるので、純粋に記事書いてもらえればOKなんですが…",
        "個人でブログを書いている家族たちにはお断りされてしまいました（苦笑）",
        "Qiitaでもう書かない理由",
        "利用規約の一文です。",
        "プログラミングに関する記事を投稿しよう",
        "Qiitaは「プログラミングに関する知識を記録・共有するためのサービス」です。プログラマーが興味を持つものではなく、プログラミングに関する記事を投稿しましょう。",
        "これが妙に引っかかったのです。",
        "私はサービス→目的解決を目指します。その手段がたまたまプログラミングだった、というケースが多いのです。",
        "なので、「プログラマーが興味を持つもの」が記事作成のモチベーションです。これを真っ向から否定されてしまっては、あまりやろうと言う気になれないのです。",
        "極端ですが、",
        "Qiitaはサービスの利用者（プログラマー）がより良い環境を作ることに関心はないのか？",
        "と疑ってしまいます。",
        "その割に、",
        "ランキング紹介記事",
        "が上位に上がったりと、もはや何がなんだか分からないです。",
        "そして、これは私のプログラマーとしての考え方ですが、ノンコーディング（プログラミングをしない）で作るシステムは非常に優秀、というものです。",
        "プログラミングはあくまで問題解決の手法であり、プログラミングのためにサービスがあるのではないのです。",
        "（もちろん、プログラミングのためのサービス自体は否定しません。お客様のサービスを作る時に、プログラミングのための作り方をするな、ということです。）",
        "私がnoteで書くプログラミング系の記事は、大体がサービス紹介や運用提案といった、開発・保守のプログラマー向けの記事です。",
        "補足",
        "まるで私はできないプログラマーのように見えてしまったので、急遽追記しました。",
        "私の評価については個々人の判断に委ねますが、こういったプログラミングに否定的な記事ではなく実際の成果物でご判断いただく方が良いかと思います。",
        "参考：",
        "GitHub"
    ]
}