{
    "id": "nf7ef3bd4152a",
    "title": "「カタンの開拓者たち」をソロプレイでずっと遊び続けられるステキアプリを見つけた！",
    "link": "https://note.com/nomuragoro/n/nf7ef3bd4152a",
    "author": "中 翔（のむらごろう）| IT教育の効果的な受講方法の案内人",
    "publish_date": "2020-07-24T21:51:51+09:00",
    "content": [
        "https://www.youtube.com/watch?v=BAWr8J9LBmA",
        "この通り、本来は人数制限のあるテーブルゲーム（ボードゲーム）ですが、これが一人でも遊べるよ！というお話です。",
        "# どこからダウンロードできるの？",
        "https://play.google.com/store/apps/details?id=com.exozet.android.catan&hl=ja",
        "https://apps.apple.com/jp/app/catan-classic/id335029050",
        "600円、有料です。",
        "## 追記",
        "Android版は410円で買えます。",
        "https://amzn.to/3jKDAB3",
        "## ちなみに",
        "アナログで買えるんですが、高いです。",
        "600円という設定が安すぎると思うのはこういった面からも感じるのかもしれません。",
        "https://amzn.to/2D6niBK",
        "後述しますが、スタンダート（基本ゲーム）でこの値段です。",
        "## やってみた感じ",
        "オンラインに価値を感じる人はいざしらず、オフラインで一人でカタンを遊べる、という点にだけ価値を見い出せば唯一の存在かもしれません。",
        "若干挙動が怪しいですが、バグで落ちるというよりはUXが不親切なだけで、慣れれば気にならないレベルです。",
        "「まぁ600円だし、試してやるか」ぐらいの感覚が良いでしょう。",
        "私も一人でカタンで遊べるならいいや、ぐらいの感覚でしたが、２回ぐらい回した頃には、「600円でカタンを遊べる」という感動に包まれています。",
        "それぐらい、探しても見つからないのです。",
        "ただし、レビューサイトにもあるようにダイスの偏りとか集中砲火とかされている気がしないでもないので、それなりのゲームスキル（期待値計算とか）は求められますがカタンガチ勢なら当たり前ですよね？",
        "っていうメッセージを感じないでもないです。",
        "一応、親切なチュートリアルはあるので操作方法を覚えたら一旦やってみて、次に盗賊辺りの意味が分からなくなるので、困ったら見直しましょう。",
        "４回ぐらいやれば初心者の方でも本腰入れて良いプレイができるはず。",
        "## ランカーの方へ",
        "カタンは運ゲーではない",
        "ので",
        "、",
        "私が何を言っているか分かる人にとって、あまり強くないと感じるかもしれません。",
        "縛りプレイをしないと面白くないかもしれません。",
        "私のレベルと所感で恐縮ですが、ベーシックルールだと交渉封印だと余裕で勝てます。",
        "交渉強制快諾プレイでトントン、港封印で苦しいぐらいでした。",
        "思うに、やっぱりあまり強くないです。",
        "## 収録内容",
        "- 航海者",
        "- 都市と騎士",
        "ほか、基本セットで配置がちょっと違ったり、勝利ポイントに補正がかかったり、配置制限があったり…",
        "正直、これだけでも十分楽しめます。",
        "シナリオじゃないですが、ゲームモードが２３もあるので、お好きなもので楽しめます。",
        "## アプリ内課金について",
        "拡張機能は別途買う必要があります。",
        "が、現状でも満足している私は、今の所買ってはいないです。",
        "全部遊びたい時に買うのがいいでしょう。遊べば遊ぶほど安く感じてくる（買っても良いんじゃないかと思う）んじゃないかと思ってます。",
        "## 追記",
        "ついに買ってしまいました...",
        "即落ち２コマレベルのオチに自分で苦笑してしまいました。",
        "https://note.com/nomuragoro/n/n10cfd4a75af8",
        "# 無料はないの？",
        "カタンユーザーなら分かると思いますが、ただでさえ高いのに人も集まらない、でもやりたいユーザーは多いのがカタンの特徴みたいなものだと思っています。",
        "なので、無料だとかそういう話の前に「えっ？！　カタンって一人でも遊べるの？」という方が衝撃がすごいんです。",
        "この記事は、そういう方向けにしか書いていません。",
        "細かい話はカタンガチ勢や動画サイトをご覧ください。"
    ]
}