{
    "id": "n10cfd4a75af8",
    "title": "【感想】catan classicを遊び尽くす！全課金する価値はある？",
    "link": "https://note.com/nomuragoro/n/n10cfd4a75af8",
    "author": "中 翔（のむらごろう）| IT教育の効果的な受講方法の案内人",
    "publish_date": "2020-07-30T14:12:05+09:00",
    "content": [
        "今回はQ&A式に。",
        "実際に私が買うまでの話と、買ってからの話です。",
        "# Q. 高くない？",
        "A. 高くない、どころか安い。",
        "宣伝くさくて恐縮ですが、前回記事（後述）にも書いた通りアナログボードを¥3,000で買って遊ぶ相手がいないより、¥600で買ってオンラインでも遊べるのはホントに神アプリだと思ってます。",
        "https://note.com/nomuragoro/n/nf7ef3bd4152a",
        "ちなみに、ブログの扉絵用に良いキャプチャ探していた時に気付いたんですが、Android版ならAmazonでもっと安く買えますよ。",
        "https://amzn.to/3fexZPH",
        "iPhone版は分からなかったです。",
        "# Q. 買ってないと豪語していたが？",
        "A. やってるうちに物足りなくなってきたので、¥1200ぐらいならまあいいか、って。",
        "遊べるシナリオ自体には満足していたんですが、あまりにも敵AIが弱すぎてヒマになったので、それならバリュエーション増やしてやろう！という感覚でした。",
        "# Q. 買ってみて良かった？",
        "A. 良いものと考えるものがある",
        "航海者パックのキャンペーンシナリオ（１６話分）は良かったです。",
        "航海者が良すぎて都市と騎士パックのキャンペーンシナリオ（６話分）はもうちょい頑張れ、と思います。",
        "航海者パックのキャンペーンが終わる頃には、唯一の都市と騎士マップでは勝利点が７点なので物足りなさを感じます。",
        "下手すれば騎士縛りの方が良いかもしれないので、騎士の良さが分からないまであります。",
        "騎士ルールで遊びたい場合だけ買う手もありますが、どうせ¥600なので一つ買うなら全部買っていいと思います。",
        "あと、新作シナリオの「魅惑の大地」「大運河」セットはそれぞれ特殊ルールがあり、理解するまでが大変でしたがこれはこれでアリです（後述）",
        "# 有料にしました",
        "いただいたサポートは新しいアプリとかのダウンロード費に充てる狙いもありますが、それ以上に有料の内容がバンバン出てくるので、さすがに全公開は控えたいなぁ、という理由で設定してます。",
        "概要だけ伝えると、",
        "- 航海者パック（おすすめ度：★★★★★）",
        "- 本作で選べるキャラが全員出てくるので、実質本編",
        "- 都市と騎士パック（おすすめ度：★★★★☆）",
        "- シナリオはあってないようなもの。騎士ルールの勝利点開放のためと割り切る。",
        "- 新作シナリオセット（おすすめ度：★★★★★）",
        "- いつものゲームと違う刺激があって楽しい！",
        "- AIの変化",
        "- 無料の時にこんな事したっけな？と思うぐらい改善されている",
        "です。",
        "では、以下で解説していきましょう。",
        "# レビュー：航海者パック",
        "無料で遊んでいた時のキャラクターに物語が生まれる瞬間です。",
        "特に何も考えなくてもゲームを設定してくれますが、シナリオ中で共闘するような雰囲気を見せながら、めっちゃバチバチやられます。",
        "普通にカタンを遊んでいたら負けます。頭を使いましょう。",
        "16シナリオもあるので、ヌルゲーだと思ってナメて掛かると痛い目をみます（５敗）",
        "愛用していたキャラはショーンだったんですが、こいつめっちゃ悪役でした。",
        "いっそクソかも知れません。",
        "ヒルデガルトは評価が分かれるなぁ。",
        "宗教の犬か、敬虔な信者か。",
        "カンダミールとか絶対悪役だと思いましたもん、普通にいい人でした。",
        "騎士パックのシナリオも絡んできますが、マリーアンがただの村人ではなかったのには驚きました。",
        "人は見た目で判断してはいけませんね、反省。",
        "# レビュー：都市と騎士パック",
        "騎士ルールを覚えるまではつらいですが、運要素を何とかしやすいので集中砲火を食らってもあまり理不尽さを感じにくいかも知れません。",
        "放っておけば勝手に勝利点が貯まるし、その気になれば際限なく遊び続けられます。勝利点30点ぐらいにすると、速攻で家と都市を作るよりじっくり先を見据えたプレイを求められるようになり、遊び方が一変します（ゲームでは出来ません）",
        "キャンペーンシナリオでは、せいぜい20点ぐらいですがこれでも結構しんどいです。",
        "速攻で決めるか、じっくり構えるかの判断を求められることが多くなります。",
        "# 考察と攻略：新作シナリオ「魅惑の大地」",
        "本島とは別に広い離島があり、ドラゴン（騎士で倒すと勝利点）19体がいます。",
        "離島のドラゴンの巣は砂漠ばかりなので、補給拠点と侵略拠点のどちらから対応するかが鍵です。他のプレイヤーの動きに引きずられやすく、一度進めたら引っ込みがつかないのがこのシナリオの難しさでもあります。",
        "まともな資源を確保したら上陸点がなくなっている、なんて事も。",
        "邪道プレイですが、本島を育てまくって騎士を適当に置いたら、都市を作って他プレイヤーの都市を弱くする手もあります。",
        "CPU戦をすると、逆に本島を育てまくるプレイヤーが出るのであながち邪道プレイでもない？のかも知れないです...",
        "# 考察と攻略：新作シナリオ「大運河」",
        "運河マークが分かりにくいので、どういう運河が開通するか線で書いてみました。",
        "専門交易が離島にありますが、本島南部の３：１港があれば要らないかも知れません。",
        "序盤はとにかく麦が不足するので、一点特化が基本になります。",
        "初期配置の都市は木エリアに置き、麦＞紙の順で集めましょう。科学Lv4になれば小麦が入りやすくなります。",
        "また、初期配置の開拓地を本島北部の6羊・11羊・10土周辺に置き、最初期から麦エリアを街道で塞ぎつつ独占できるようにすると後半が一気に楽になります。",
        "なお、12麦は発明家でも動かせない不作地なので最初から気にしなくていいです。どちらかというと右下の3麦が「発明家」で5とか9とかに変えられないように注意する必要があります。",
        "# AIの改善について",
        "ちょっと作為的な書き方をしましたが、カスタムシナリオではないです。",
        "キャンペーンシナリオの敵AIが別物レベルで強くなった？と思うぐらい集中砲火を浴びます。いや、",
        "強くすべきはそこじゃない。",
        "おかげでストレスがすごい。",
        "とはいえ、リアルでカタンをやる時も似たような事は当然あるので、リアルっぽいと言えばリアルっぽいです。",
        "カスタムシナリオで歯応えがなくなったらキャンペーンを遊びましょう。",
        "リアルプレイの練習をするなら、キャンペーンでノーコンティーニュー制覇を目標にするのもアリです。"
    ]
}