{
    "id": "n0476615e67a9",
    "title": "クトゥルフTRPG「毒入りスープ」道場から考えるKP(GM)の振る舞い（キーパリング）",
    "link": "https://note.com/nomuragoro/n/n0476615e67a9",
    "author": "中 翔（のむらごろう）| IT教育の効果的な受講方法の案内人",
    "publish_date": "2020-08-10T04:50:43+09:00",
    "content": [
        "https://www.nicovideo.jp/watch/sm36777699",
        "- CoCシナリオ「毒入りスープ」のネタバレを含みます。",
        "- 扉絵はフリー素材とのことでしたので、以下よりお借りしています。感謝！",
        "https://note.com/tetotsuyuko/n/n6df7d791b50f",
        "# シナリオの良し悪し（ゲームの難度）は、KPが回しやすいシナリオかどうかで決まる",
        "最近カタンばっかりやってますが、元々は卓ゲ者（テーブルトークRPGゲーマー）なのです...",
        "先日、ダイスの期待値の話を書いたのですが、思わず卓ゲをやりたくなってきたので、いわゆる鬱憤晴らし的に。",
        "# 毒入りスープとは？",
        "クトゥルフTRPGの初心者PL・KPがいる場合に使いやすいシナリオです。",
        "その規模・認知度はもはや道場扱い。カタンじゃないですが、キャラクターの作り方やプレイヤーによって攻略の仕方が変わるのが楽しさの１つでもあります。",
        "本家をdisるつもりはありません。",
        "が、穴はある（公式ブックのシナリオ集より非常に出来が良いです）のでこれをキーパリングで何とかする方法と、シナリオの穴を埋める方法を考えます。",
        "当然ですが、キーパリングはスキルが求められますし、シナリオの穴を埋めるのは読み込みが重要です。",
        "そして、大体の場合はルーニープレイ（ぶっ飛んだプレイをするもの。汚れた手を洗うためにスープに手を突っ込むとか）を想定しないので、キーパリングスキルが重要になってきます。",
        "# 初心者KPの、失敗しないヒントの出し方",
        "これは上級者KPにも言えることですが、基本的にPLのやりたいことを咎めないことです。",
        "それがどんなにぶっ飛んでいても、意に沿わない事でもです。KPはゲーム中では感情を失くしましょう。",
        "PLは主張をする際はロールプレイ（演技）をしましょう。○○やりたい、出来る？と聞くのは洋マンチ（マンチカン・口喧嘩プレイ）になりがちです。",
        "KPは困ったら、「分かりました。ロールしてください」とぶん投げていいです。",
        "## KPが干渉するタイミング",
        "PLがゲームの進行を進めるのに時間がかかる時などが考えられます。",
        "そういう場合は大体が情報不足なのですが、",
        "## 進行が止まる例",
        "KPは、日本人プレイヤーは自ら発信するのがヘタクソだということに意識する必要があります。",
        "ざっと思い出せる範囲で、",
        "- プレイヤーにゲームの目的がハッキリしていない場合",
        "- 勝利条件が分からない",
        "- 手がかりが見つからない",
        "- 苦手な判定を回避しようとする",
        "- プレイを萎縮してしまっている",
        "- 強い敵が居る",
        "- SAN値が低い",
        "- その他キャラクターロストの可能性がある",
        "- シナリオがつまらない",
        "- 特定のプレイヤーに引きずられる（戦闘に多い）",
        "- ルーニープレイ",
        "- ロールプレイをしていない（ハック＆スラッシュになっている）",
        "- プレイング・キーパリング",
        "- プレイヤーと異なる空間・時系列などの事象の食い違いと誤り修正のまずさ",
        "- プレイヤーとの口（くち）プロレス（大体はプレイヤーに善意の忠告をしたことで発生する？）",
        "- ルールブック至上主義",
        "があります。",
        "オンラインセッションだとツールの使い方がわからない等もありますが、進行不可能になるケースはほとんどないです。",
        "# シナリオはKPの読み込み次第でいくらでも簡単になるし、難しくなる",
        "「毒入りスープ」を例に分かりやすい話をすると、",
        "- 簡単：最初に開く扉はどこを選んでも奴隷部屋にする",
        "- 簡単：図書室（本の部屋）の黒い本を複数置く。キッチンの部屋の情報をもたせる",
        "- 簡単：判定の達成値を段階的に設定する",
        "- クリティカルで他の判定で失敗した場合の追加情報を提供する",
        "- 達成値の半分以上で追加情報の可能性と追加情報の技能・達成値を公開する",
        "- ※判定に失敗しても「失敗するまでの経緯」を説明したり、失敗なりに違う情報を提供する。",
        "- 難しい：時間経過で地震が発生して、中央の部屋の明かりが消える",
        "- 難しい：ファンブル時に、情報源の一つを消滅させる（同じ情報を複数の手段で得られる場合）",
        "- 難しい：ツァトゥグァの無行の落し子との邂逅を必須にするなど、何らかの行為判定でSAN値チェックを強制する",
        "- 上級：RTAをする",
        "といったアプローチが考えられます。",
        "が、これは毒入りスープを読み込まないと考えもしないはずです。",
        "# クトゥルフTRPG「毒入りスープ」道場から考えるKP(GM)の振る舞い（キーパリング）",
        "まずはPLのスキルを確認しておきましょう。",
        "ざっくりCoC歴とオープン・クローズド卓の違いでアプローチが異なるはずです。",
        "その上で、一度はシナリオを読んでいるはずなので、頭でいいからテストプレイしておきましょう。",
        "きっと「何いってんだこのシナリオは？」と思う点があるはず。",
        "見つけた粗は、メモをとるなり対応の気づきを持つようにしましょう。"
    ]
}