{
    "id": "n8fb830a79c61",
    "title": "コメント欄は必要か？Web開発とソーシャルサービス運用から考える保守コスト",
    "link": "https://note.com/nomuragoro/n/n8fb830a79c61",
    "author": "中 翔（のむらごろう）| IT教育の効果的な受講方法の案内人",
    "publish_date": "2020-08-08T18:20:30+09:00",
    "content": [
        "いちアドテックエンジニアとして、いちアフィリエイターとしての見解です。",
        "コメントの質だとか政治的だとかそういう話はなるべく触れないようにしています。",
        "# はじめに",
        "まずはそれぞれがどういうものなのか、ざっくり解説します。",
        "## Yahooコメント",
        "コメントサービスと言って今一番目立つのは5chではなくYahooや教えてgooといった気軽に質問・回答ができるサービスではないでしょうか。",
        "コアユーザーのために明記しますが、昔は5chや2chの声が大きかったのですが時代は変わりました。",
        "5chなどは危険なサイト・Yahooは安全なサイトだという「誤認識」もあると思います。",
        "コメントが一日２万件近くが自動で削除されるシステムが動いているにも関わらず、非常に活発なコミュニティです。",
        "- 一日で２万件近く削除されてもコメントがなくならない",
        "- コメントを削除されてもコメントし続ける風潮",
        "- そもそも一日で２万件自動削除されなければならない土壌",
        "の３つが詰まったやばいコミュニティだと言い換える事ができます。",
        "ぶっちゃけ、初心者歓迎といいつつシステムでボコボコにやっているわけです。",
        "コメントを否定したらヤフコメはなくなります。",
        "この二律背反が、コミュニティビジネスの難しさを考えさせられます。",
        "## 5ch(旧2ch)",
        "これは一つのテーマにコメントが1000件まで書き込める超巨大掲示板で、大体はスレッドと呼ばれるテーマごとの部屋を一つ作って、作った人が最初の書き込み（１・スレ主と呼ばれる）に話題を提供します。",
        "１が書いた内容やリンクがあればそちらを参照しつつ、議論を交わしていくんですが、基本的にヤフコメ民と同じくタイトルだけでコメントする人がすぐに分かる仕組みになっていて分かりやすいです。",
        "まとめブログと違って、一切脚色がされないので読みやすさという点では他の追随を許さないのですが、NGワードや通報機能があるので自浄機能があります。",
        "口は悪いですが全体的にネットリテラシーが高いので、ユーザー側に「半年ROMってろ」（暗黙の了解がある）を求められますので、交流の質は高いのですが参入障壁も高いので、完全に住み分けられていると思います。",
        "とはいえ、他のコミュニティと違ってネット文化が根付く前からある古株です。",
        "他コミュニティと同列に評価することが正しいとは限らないです。",
        "## まとめブログ",
        "大体は上記5chのコピペ・転載なのでカテゴリは同じ。",
        "ただし、こちらは主にTwitterで集客しているので、事実上Twitter民だと言われています。",
        "まとめブログを語る場合は、当該サイトのコメント欄はもちろん、非公式RTによる引用やエアリプ（＠リプライをつけずに記事や人に言及すること）も見ないと全貌が掴めないのが厄介です。",
        "そこまで追いかける人は大体「自分が傷つかない話」に限ります。自身を批判しているコメントのエアリプまで追いかける体力がある人を聞いたことがない…。",
        "以上を踏まえてまとめると「5chをTwitterでやったらどうなる？」をやったものと考えることが出来ますね。",
        "情報の出どころが行方不明なので、信憑性の低い話もあります。コミュニティとして活用するには少々質に問題はありますが、居心地のよい場を作りやすい事は確かです。",
        "他のコミュニティと違い、運営が話題を提供するため厳密にはコミュニティの体を成していません。",
        "人の目に触れる事は多いので賑わって見えますが、運営が飽きたらユーザーが解散するからです。",
        "ユーザーはファンではなくただの野次馬です。",
        "### 運営者自体の問題",
        "どことは言いませんが、ニュースメディアのほとんどの媒体でコピペで成立しています。",
        "よく読まれるあの媒体も実はパクリ記事だった、なんてことが往々にしてあります。",
        "これはコミュニティ運営というよりはパクリサイト問題で取り上げるべき内容ですが、",
        "ニュースサイトをパクるコミュニティが存在する",
        "ことをご存知でしょうか？",
        "彼らはビジネスでの付き合いであるため、コミュニティ運営という観点で語るより高額情報塾・マルチビジネス特有の閉鎖的なアングラコミュニティという観点で見ることが出来ます。",
        "本旨から逸れるので存在に言及するのみに留めます。探せば結構見つかります。",
        "## teratail",
        "残念ながら初心者歓迎の初心者お断り風潮がエンジニアコミュニティにも蔓延っています。",
        "teratail特有の問題として「質問者がやりたい事を丸投げする」もありましたが、質問側が何を質問すればいいか分からない事をすくい上げるという思想はないので、質問コミュニティでありながら初心者お断りというダブルスタンダードぶりが滑稽です。",
        "質問者の質が良くても回答者の質が高いとは限らないのですが、その全責任を質問者に押し付けているため、質問者＜回答者の構図が出来上がっています。",
        "つまり、コミュニティ内で上下関係が明白に出来上がってしまっています。",
        "とはいえ、質問コミュニティの運営という点で考えると新規でやってくる質問者より、運営で協力してくれる回答者を取るのは当然のことです。",
        "が、一部のユーザーと合わないという理由で利用を敬遠されやすくなるので、いずれ運営サイドが規模拡大を考える際は新しいコミュニティを作り直さなければならないタイミングが出てきそうです。",
        "とはいえ、ユーザーとファンが共存しており、運営が直接的に管理を頑張る必要も薄いので一つの成功系ではあります。",
        "（開発元は今もteratailを良いコミュニティにするために尽力されています）",
        "## Qiita",
        "teratailがユーザー主体ならQiitaは運営主体です。",
        "同じエンジニアリングをテーマにしつつ、運営方針をテコ入れしまくったため今までやってきた事とギャップが大きくなってしまって、一部のコアユーザーを重視する結果になったのも事実です。",
        "問題点こそteratailと同じですが、Qiitaは受け身ではなく発信タイプであるためユーザーが誤った情報を発信するリスクが高いです。",
        "従ってコアファンによる運営リスクは高まります。彼らが問題を起こした時に毅然と対応をする必要がありますが、発信者したコアファンには一定のファンがついているため、コミュニティの不穏分子を切り捨てる判断をする事になります（過去にありました）",
        "結果、全く関係のないユーザーも締め上げる事になるため、初期の運営方針や思いをユーザーに徹底させる必要があるため、後出しジャンケンや特定ユーザーに対する免責行為が見えると忖度だと思われてしまいます。",
        "私がQiitaをやめた理由という記事も書きましたが、こういった背景があります。",
        "https://note.com/nomuragoro/n/ndc77430d723c",
        "コミュニティの運営中に様々な問題はありますが、時代に合わせて変化する必要はありながら、ユーザーに提供するサービスは初志貫徹しないと不信感を買うことになります。",
        "# コミュニティビジネスを考える",
        "まず当たり前ですが、コミュニティを運営するのは主催です。",
        "ただし、",
        "コミュニティを作るのは主催ではありません。",
        "主催が招いた人たちであり、彼らが住みやすい空間がコミュニティになります。",
        "コミュニティの善悪は運営者の方針と一部の発言力の強い参加者が決めてしまうということです。",
        "一部だけが盛り上がって、周りが消極的になってしまうのは仕方のない事ですが、コミュニティオーナーこそ全体に伝搬する役割を持たなければ「幽霊部員」が増えるのは当然で、イコール「コミュニティの合う・合わない」は当然発生します。",
        "趣味のコミュニティとビジネスのコミュニティも性質は違いますが、起きうる問題は同じです。",
        "ビジネスコミュニティをユーザーサポートの場にしてしまう方法もありますが、コミュニティでマネタイズするのはリスクも高いため、やはりある程度の企業努力は求められます。",
        "コミュニティをビジネスにする話も書こうかと思ったんですが、コミュニティ運営の王道がない、という事は明記しておきます。",
        "失敗は一定の定義できますが、成功はコミュニティの運営方針ごとに異なるためです。"
    ]
}