{
    "id": "n615b855478a1",
    "post_id": "41",
    "title": "東京九州フェリー「それいゆ」に乗ってみた",
    "publish_date": "2024-12-08T19:36:25+09:00",
    "status": "publish",
    "post_type": "post",
    "content": [
        "本稿は私が体験から感じた範囲で重要度が高い順番に書いているため、時系列で追いたい場合は各章の数字に着目してほしい。",
        "うっかり癖でmarkdownで書いてしまったので、この書き方に準拠する",
        "本稿を読み進める際の前提",
        "今回はOSC福岡に参加し、東京に帰るというシチュエーションである",
        "日曜日中に東京の家に着けば良い",
        "早く家に帰っても遅く家に帰ってもパソコンで完結する仕事がある",
        "仕事内容はネットワークの影響を受けない",
        "そのため、東京ー九州間を走っているもう一つの東九フェリーは使えない",
        "（筆者も、東九フェリーと東京九州フェリーは別物だと思っていなかった）",
        "酔い対策の重要性を認識する",
        "交通手段別に見る、酔いと快適性",
        "まず、色々な交通手段を見ていこう",
        "時間については、当該手段を用いた時間のみで、最寄駅や空港までの時間や経路は考慮しない",
        "たとえば、飛行機の場合は「バス＋飛行機＋バス＋在来線」のような手段が考えられるが、飛行機のみである",
        "| 手段 | 時間 | 価格目安 | ポイント | リスク | コメント |",
        "| --- | --- | ---- | ------- | ----- | ------- |",
        "| 飛行機 | 短 | 時価 | 途中、立ち歩きやすい | 酔っても降りられない | 空港in-outまで4時間 |",
        "| 新幹線 | 短 | 3万円足らず | やむを得ず途中下車の選択肢がある | 基本的に動けない | のぞみで５時間 |",
        "| 夜行バス | 長 | 2万円前後〜 | 何度か休憩があり、最悪降りられる | 基本的に動けない | 4席車の場合、自分か隣人の体格が大きいと苦労する |",
        "| フェリー | 長 | 2万円前後〜 | ほぼ制限がない | 酔っても降りられない | 港in-outまでほぼ1日 |",
        "長所にあげている「移動状態を続けられなくなった場合」への扱いの有無と言っても過言ではない。",
        "これに近いか、次点ぐらいでストレスへの対処可能性をピックアップした。",
        "主にこの２つが課題になるだろう。",
        "快適性や酔い対策を考えると飛行機の選択肢は捨てがたいが、時期によっては非常に高額になりやすいため気軽な選択肢とは言い難い",
        "LLCを決めてから合ったイベントやプランを選びたい。",
        "今回は東京ー福岡での家族旅行を想定してフェリーを利用している想定で、下見（結果的にそうなった）してみた話である。",
        "酔った時にどうすれば良いのか？",
        "具体的な交通手段として、致命的な飛行機とフェリーを考える。",
        "飛行機については、しばらく我慢すれば終わりが見えてくる。",
        "フェリーは我慢したところで、1日この状態が続くので選択肢としては適切ではない。",
        "そのため、事前の酔い止めは必須として、酔った時にどう過ごすのかが重要になることを今一度留意したい。",
        "その上で、酔いやすい方法がどんなものかを考える。",
        "逆に言うと、酔いやすい事象が分かれば、そのような行動を控えるのが良い",
        "・横になる: 頭が直接船体に接触するためか、非常につらい状態になりやすい状態を回避するためには？",
        "座った体制を維持して揺れの影響を緩和しつつ、頭（脳）への刺激を緩和する。立ち歩いている状況でも酔いは発生することを考えると、立つ状態はベターではない",
        "風呂に入る。個人的には推奨の方法。必然的に座る体制が多くなるし「何か」をするので気が紛れやすい。体を洗うなど",
        "パソコンやスマホを使ってネットワークに繋がない仕事をする。本を使ったプログラミングの学習がおすすめ。酔わないために仕事をするのでコンディションは微妙だがモチベーションは高まる。",
        "体育会系のノリを持ってきてしまうので、デスクワーカーとしては複雑な気持ちもあるのだが、案外「気合いで乗り切る」というのも悪くない選択肢なのかもしれない。",
        "たとえば、荒天（波が荒れているなど）の強い揺れがある場合に吐き気を覚える場合などは「やり過ごす」という選択肢は候補に上がるのかもしれない",
        "1. 事前準備",
        "工程を分けて準備物を揃えたい",
        "これらについては入念に調べておこう。特に下船後を行き当たりばったりでやろうとすると予約が取れない、なんてこともありうる",
        "1.1. 乗船するまで",
        "酔い止め",
        "特に食べ物・飲み物はある程度持ち込んでおきたい",
        "タオル類",
        "コインランドリーが使える事が多いので、バスタオル・フェイスタオル１本あれば問題ない",
        "1.2. 乗船中の過ごし方",
        "酔いへの対策",
        "酔わないために、揺れを感じにくい状態を作る",
        "個人的にはお風呂に入っていると揺れがわからない印象あり",
        "横になると揺れを感じやすいので、なるべく座ったり立ち歩いたりしよう",
        "1.3. 下船後の交通手段",
        "特に新門司港着の場合、移動手段は必須。",
        "バスに乗って門司港駅か小倉駅まで出るのが王道か。",
        "横須賀港は荷物量にもよるがまだ歩いてなんとかなる距離だ。タクシーは呼べない可能性も高いため期待しないでおこう。",
        "1.4. 荷物を減らす方法とタイミングを予定（工程）に組み込む",
        "どうせ観光するのでお土産品が増えるのだから、行きの時点で多くの荷物を持つことを推奨しない。",
        "現地調達が可能であれば選択肢にあっていい（持ち運びの手間を削減した分の費用として）",
        "たとえば、ホテルなどに事前に送れるのであればその方が良い。逆に、帰りは荷物をなるべく減らすために宅配サービスを使う事で帰りも快適性を維持する事ができる。",
        "フェリーでの過ごし方を考える",
        "一日中寝る: 揺れが強い区間では酔いやすくなるので非推奨だが、そこさえ気をつければ案外悪くない。というのも、一日フェリーで過ごすのは実は結構しんどいので、開き直って寝る時間に充てること自体は有意と考える",
        "イベントを楽しむ: せっかく旅行なのだから、楽しめるものは全部やった方がいい。船内アトラクションの中にはハズレもあるだろうが、やらない後悔よりやって後悔。",
        "オフラインでできる勉強: 良くも悪くも暇すぎるので宿題するにはもってこいの環境である。ネットワークが貧弱すぎるので仕事はおすすめしない",
        "フェリー（海上）では陸上（地上）の常識が通用しないので、フェリーに乗る前にどこかでスマホ（インターネット）から離れた生活をプレ経験してみるのも良さそうだ。",
        "2. 工程",
        "2.1. 新門司港の受付まで",
        "九産大前駅（九州産業大学）から小倉北口＝新幹線口に22:10（遅れた場合は門司港駅南口に22:30）までは電車一本でいける。",
        "行き先によっては乗り換えが発生することもあるようで、今回は運が良かった。",
        "博多経由でこだまに乗るのが1番早いプランだが、時間にゆとりがあったのと、そもそも早く着いたところで何もできないため車内でゆったりパソコン作業ができそうな各停鈍行プランを採用した。",
        "2.2. 乗船後",
        "まずは船のルールや場所を確認しよう。",
        "翌朝8時から使えるサービスが多いので、何ができて何ができないかを正しく把握しておく",
        "重要度が高いものだと特にWifi、ルールがきついのでしっかりと確認しておきたい。",
        "お風呂によく入りたいならコインランドリーと、部屋によってはコインロッカーは必須級だろう。",
        "Wifiは言わずもがな（それでも繋がりにくいが、繋がらないよりマシ）だが、コインランドリーがあるとタオルの選択ができるので、船内で買ったタオルを再利用できるようになる。夜だけでなく朝風呂も楽しめるようになるのは大きい。",
        "また、男性ならサウナ・露天があるとタオルを節約できる事があるかもしれない。",
        "2.3. 翌朝8時〜",
        "レストラン（細かい時間に注意）",
        "人気メニューは早い者勝ち（昼夜・朝も含むメニューが欲しい場合はあまり気にしなくてよい）",
        "時間が短いのですごく混むことも",
        "船上バーベキューも",
        "大浴場",
        "シャワールーム",
        "案内所",
        "ショップ",
        "生活用品の在庫とか",
        "その他、船内イベントやスポーツジムなどもあるので、館内放送はしっかり聞こう",
        "特に乗船時に使えたものは、翌8時には環境などが変わっている可能性もある",
        "2.4. 下船前",
        "荷物をまとめるのは当然として、その後の交通手段を用いる場合はスムーズな移動ができる状態にしておきたい。",
        "たとえばバスに乗る場合は、トランクに預ける荷物と手荷物を分けるなど。",
        "多少手間がかかったとしても、そのタイミングごとに最適化できるようにしたい。",
        "実行",
        "後の自分にPDCAサイクルを回させる計画。",
        "以下、結果としてどうだったかを書いていく。",
        "主にお気持ち表明のコーナー。Qiitaじゃ絶対できないね",
        "筆者がサウナ好きで、こればっかりであんまり参考にならないかも。",
        "乗船日",
        "ちょうどQiitaアドベントカレンダーにも参加している関係で、フェリー乗船中の日付についてあらかじめ記事を予約投稿しておかないと、当日に記事を書いている余裕（そして、投稿できるタイミング）はない。",
        "21時ぐらいには乗船後に軽く食べれるものと2Lの水を確保",
        "何気に船内でのカップラーメンの価値は高い。価格も300円からと高い",
        "22時までに東京九州フェリー乗り場行きバスに乗る。小倉駅か門司港駅",
        "23時までバスに乗る。補助席を使うほど満員になる",
        "24時に搭乗。一般とモニターがおり、私は一般だったので先に入った。が、そもそも寝所の場所は固定なので先も後もない。モニターがどこでできるかは分からないが、フェリーもLLC的なところがあるんだな、と認識",
        "Wifiとコインロッカーを確保。今回は滑り込みで取れたツーリストAだったので必須",
        "（所感）そもそも大荷物（キャリーケース）は入らないが、手荷物（鞄程度）は入るので、最初からキャリーケースを使わない運用を考える",
        "寝所（カプセルボックス）の空間は狭いので荷物を内部に入れるとあっという間に眠りが損なわれる",
        "お風呂は使えるので、サウナへ。",
        "翌日",
        "〜8時：から施設営業が始まるので、それまではグダグダやる",
        "ラウンジスペースは使えるので、目が覚めたら寝転がるよりは座って何かをしていた方が良さげ（酔いやすい）",
        "この時点でインターネットには繋がらない（Wifiは繋がっても使えない）",
        "BBQを予約しておいた方がよかった",
        "8時〜20時：以下ルーティン",
        "レストラン：前日に朝食で失敗したため、同じ問題を察知して見送り。ご当地メニューだけ食べるも、肉メニューが欲しくなって先述のBBQを希望しておけばよかったと後悔",
        "何気にお腹が空くと頭の回転が鈍るので、ここをケチっても仕方ない",
        "大浴場：酔った時の駆け込み寺。特に用事がなくてもとりあえず入っとけぐらいの感覚で利用。単純にサウナに入って寝転がるというルーティンに幸せを感じる",
        "荒天時、お風呂の中で波が発生していて、ちょっと新鮮な感覚に",
        "エントランスラウンジ：オーシャンビューといえば聞こえはいいけど、そればっかりは飽きる。座って仕事をする場所",
        "寝室： 仕事やサウナで疲れて寝落ちする場所",
        "20時〜下船：船上生活のためにバラした荷物を移動仕様のために組み換える。もう少し早いタイミングから4G回線がつながり始めたので、そちらでテザリングするように変更して通常業務開始（したかった）",
        "よく考えれば当然で、陸上からの電波が届かないので繋がらない問題と、そもそも回線自体の強度の問題は別。",
        "そして、この回線は一般のWifiと仕様が違うはず（推測）なので、元々高速・大容量通信より広範な接続安定性の需要が高いという事も考えられるか。",
        "ほぼ使わなかったけど、気になったポイント",
        "キッズルーム： 非常に助かる！というのも、部屋は広くないし特におもちゃとかもない（そもそも、揺れが強いと転倒リスクがあり危ない）ものの、子供たちが周りの大人を気にせずに遊べる環境があるのかないのか、は大事",
        "甲板：残念ながら一日中施錠されていたため出られず。スポーツジムエリアから外を見るぐらい。初日に外出て「寒い！」と言ってすぐに戻ったのが唯一の機会になった",
        "フォワードサロン：フェリーの前の方で眺望できるラウンジ。フロアが違うのと客室の奥なので行きにくかったが、人がいない時間はすごく集中できる上に広い作業エリアとも言える。充電も一部できる",
        "無料マンガコーナー：Wifiでインターネットに接続できなくても、船内LANで提供されているサービスなのでアクセスは快適",
        "コンビニ：事前に準備はしていたので使わなかったが、多少割高としても楽しむという体験ができる場としては良いかも",
        "次は家族でゆっくりと乗りたいものだ",
        "とはいえ、今回のように直前に体調を崩しちゃったりする事も考えられるので、事前予約がリスクになる…"
    ],
    "images": []
}