{
    "id": "n0cec4231d04d",
    "title": "私が請けたビックリ案件たち～募集企業は人員募集のプロではない～",
    "link": "https://note.com/nomuragoro/n/n0cec4231d04d",
    "author": "中 翔（のむらごろう）| IT教育の効果的な受講方法の案内人",
    "publish_date": "2020-07-30T13:06:41+09:00",
    "content": [
        "※こういう案件は嫌だ、という話はしていません。注意をうながす目的で書いています。",
        "案件難度の考え方について、私的にはビックリするような話がいっぱいありますが、どうも人事・スカウトの方には事の深刻さがご理解いただけていないんじゃないかなぁ、と感じられて仕方がないのです。",
        "この記事は、実際にあったビックリ案件と、良い求人の出し方を提案するものです。",
        "# 結論",
        "- 開発と保守の両方をやってほしい場合",
        "- 社員契約を結びましょう",
        "- ドキュメントがない場合",
        "- 先に採用向けのドキュメントを作り、人事と現場の足並みをそろえましょう",
        "- 募集内容と異なる相談もしたい",
        "- 募集内容に「オープンポジション」と文言を入れましょう",
        "以下に、一つずつ解説していきます。",
        "# ビックリ案件：開発（改修）と保守の両方を混在されている業務内容",
        "これは既に本番運用中のシステムの障害を開発契約だけで依頼をされるケースが当たります。",
        "次点に、開発・納品テストの自動化をしたいという案件に多いです。",
        "この場合、開発と保守の要件を具体的に定義する事が難しいので、",
        "時間見合いの有期顧問・派遣など社員契約",
        "をおすすめしますが、貴社規定の賃金テーブルに左右される場合は難しいかも知れません。",
        "費用相場＝賃金という事になるため、大体は賃金以上の相場になることが多いためです。",
        "そもそも、なぜこんな話になるのでしょうか？",
        "答えは、先の通り開発と保守の要件を具体的に出来ない以上、契約書に「開発支援」ぐらいしか書くことができないからです。",
        "これは、包括的に行う場合は受注側にとって大きく不利な内容ですし、「開発支援」ですので受注側に「出来ません」と突き返されると発注側も困る事になる可能性があります。",
        "新規開発と保守業務はそもそもの目的が違うからです。",
        "確かに、スキルセットとしては共通しますが業務委託は時間見合いでの業務ではありません。",
        "そのため、私が対応する場合は開発と保守で別契約としています。",
        "開発契約だけで後述の保守業務に当たる内容はお受けいたしかねます。",
        "## 例：開発業務",
        "納品物・成果物に対して報酬をいただきます。",
        "この辺りは通常契約と同じですが、私が開発した内容で障害が発生した場合は原因分析～解消までいたしますが、障害が生じた場合は別途保守契約をいただきます。",
        "## 例：保守業務",
        "作業目的に対して報酬をいただきます。",
        "たとえばサーバーダウンの障害対応の場合、実時間によらず一定の保守料金の範囲で対応しています。",
        "障害分析・障害解消・原因分析・原因解消の４つで分け、それぞれ",
        "- 障害分析：障害の内容と原因を調査します",
        "- 障害解消：現在起こっているトラブルを解消します。大体の場合、障害分析と併用します。",
        "- 原因分析：問題が起こった原因を調査します。障害分析もセットでご依頼いただくことが大半です。",
        "- 原因解消：問題の部分をシステム的またはプログラムの設計を見直して解消します。大体の場合、原因分析と併用します。",
        "と定義しています。",
        "たとえば、システムの応答が急に遅くなったり、不安定になる問題が発生した場合、",
        "1. 障害分析：メモリがいっぱいになっていることを確認",
        "2. 障害解消：サーバーを再起動する",
        "3. 原因分析：通信負荷を掛けるコードがあることを発見",
        "4. 原因解消：分散処理の考案、あるいはタイマーなど時間を置いて再実施を検討",
        "基本的に障害関連については前金制としています。",
        "原因関連については開発業務に準じます。",
        "# ビックリ案件：ドキュメントがないので、ソースコードを読んでください",
        "ほとんど全ての業務に言えるんですが、まずはドキュメントを整備してください。",
        "このやり方で採用をオススメしないのは、同じプログラマーでも合う人と合わない人が顕著に出てくるため、採用コストをいたずらに高めてしまう事を経験で知っているからです。",
        "ただ、残念な事にソースコードは設計書でもあるため、Git管理がされていればドキュメントがあると言い張る方もいらっしゃいますが、人事担当者の方が読んで説明できないものはドキュメントとは言い難いです。",
        "この場合、",
        "見積もりを有償",
        "としています。",
        "見積もりの提案を請ける・請けない問わず見積もりに要した時間分をいただきます。",
        "# ビックリ案件：募集内容と異なる相談をいただく",
        "募集内容と違っても対応しますし、出来る範囲でお手伝いしますがやはり驚きます。",
        "元々Aプロジェクトのお話？で詳細をいただいていたら、全然無関係のBプロジェクトのお話もあって、どちらに割り振るかを決めあぐねているというケースです。これもあるあるかと思います。",
        "これは私の経歴が業界・職種・言語のあらゆる面で何でも出来てしまったのも問題の一助になってしまっている事は反省していますし、当該プロジェクトに関係のある部分だけ抜粋してお話をするようにしています。",
        "が、その中でも貴社内でどうして行くか明確にご相談をいただけない事には「結局何をやるんだっけ？」という問題に陥りがちです。",
        "この場合、ご面談を通してご依頼いただく内容を決めていただいて、",
        "その上で他業務を行わない事をご了承いただいて",
        "からのご契約となります。",
        "# まとめ・総訳",
        "- 開発と保守の両方をやってほしい場合",
        "- 社員契約を結びましょう",
        "- ドキュメントがない場合",
        "- 先に採用向けのドキュメントを作り、人事と現場の足並みをそろえましょう",
        "- 募集内容と異なる相談もしたい",
        "- 募集内容に「オープンポジション」と文言を入れましょう"
    ]
}